&НаКлиенте
Процедура СформироватьНаименованиеДоговора()
	ДатаНачала = Формат(Объект.ДатаНачала,"ДФ=dd.MM.yyyy") + " г.";
	Если ЗначениеЗаполнено(Объект.Номер)
		И ЗначениеЗаполнено(Объект.ДатаНачала) Тогда
		Объект.Наименование = "№ " + Объект.Номер + " от " + ДатаНачала;
	ИначеЕсли ЗначениеЗаполнено(Объект.Номер)
		И НЕ ЗначениеЗаполнено(Объект.ДатаНачала) Тогда
		Объект.Наименование = "№ " + Объект.Номер; 
	Иначе
		Объект.Наименование = " от" + ДатаНачала;	
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	УстановитьВидимость();
	Если Не ЗначениеЗаполнено(Объект.Наименование) Тогда
		СформироватьНаименованиеДоговора();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура УстановитьВидимость()
	Если Объект.Бессрочный Тогда
		Элементы.ДатаОкончания.Видимость = Ложь;	
	Иначе
		Элементы.ДатаОкончания.Видимость = Истина;	
	КонецЕсли;
КонецПроцедуры


&НаКлиенте
Процедура ДатаНачалаПриИзменении(Элемент)
	СформироватьНаименованиеДоговора();
КонецПроцедуры


&НаКлиенте
Процедура НомерПриИзменении(Элемент)
	СформироватьНаименованиеДоговора();
КонецПроцедуры


&НаКлиенте
Процедура БессрочныйПриИзменении(Элемент)
	УстановитьВидимость();
КонецПроцедуры
