
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	УстановитьВидимость();
КонецПроцедуры

&НаКлиенте
Процедура УстановитьВидимость()
	Если НЕ ЗначениеЗаполнено(Объект.ТипОрганизации) Тогда
		Элементы.ИНН.ТолькоПросмотр = Истина;
	Иначе
		Элементы.ИНН.ТолькоПросмотр = Ложь;
	КонецЕсли;
	Если Объект.ТипОрганизации = ПредопределенноеЗначение("Перечисление.ТипыОрганизаций.ЮридическоеЛицо") Тогда
		Элементы.ГлавныйБухгалтер.Видимость = Истина;			
	Иначе 
		Объект.ГлавныйБухгалтер = ПредопределенноеЗначение("Справочник.Сотрудники.ПустаяСсылка");
		Элементы.ГлавныйБухгалтер.Видимость = Ложь;	
	КонецЕсли;
КонецПроцедуры


&НаКлиенте
Процедура ТипОрганизацииПриИзменении(Элемент)
	УстановитьВидимость();
КонецПроцедуры


&НаКлиенте
Процедура ИННПриИзменении(Элемент)
	УстановитьВидимость();
КонецПроцедуры


