
Функция getUserGET(Запрос)
	Логин = Строка(Запрос.ПараметрыЗапроса.Получить("username")); 
	
	ЗапросПользователи = Новый Запрос;
	Если Логин <> "" Тогда 
		ЗапросПользователи.Текст = "ВЫБРАТЬ
		|    УНИКАЛЬНЫЙИДЕНТИФИКАТОР(Пользователи.Ссылка) КАК Ссылка,
		|    Пользователи.Наименование КАК Наименование,
		|    Пользователи.Код КАК Код
		|ИЗ
		|    Справочник.Пользователи КАК Пользователи
		|ГДЕ
		|    НЕ Пользователи.ПометкаУдаления
		|    И Пользователи.Наименование = &Наименование
		|
		|УПОРЯДОЧИТЬ ПО
		|    Наименование";
		
		ЗапросПользователи.УстановитьПараметр("Наименование", Логин); 
	Иначе 
		ЗапросПользователи.Текст = "ВЫБРАТЬ
		|    УНИКАЛЬНЫЙИДЕНТИФИКАТОР(Пользователи.Ссылка) КАК Ссылка,
		|    Пользователи.Наименование КАК Наименование,
		|    Пользователи.Код КАК Код
		|ИЗ
		|    Справочник.Пользователи КАК Пользователи
		|ГДЕ
		|    НЕ Пользователи.ПометкаУдаления
		|
		|УПОРЯДОЧИТЬ ПО
		|    Наименование";
		
	КонецЕсли;    
	
	РезультатЗапроса = ЗапросПользователи.Выполнить();
	МассивПользователей= Новый Массив; 
	
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		
		ДанныеПользователя = Новый Структура; 
		ДанныеПользователя.Вставить("guid", Строка(Выборка.Ссылка));
		ДанныеПользователя.Вставить("name", Строка(Выборка.Наименование));
		ДанныеПользователя.Вставить("code", Строка(Выборка.Код));
		
		МассивПользователей.Добавить(ДанныеПользователя); 
		
	КонецЦикла;
	
	Ответ = Новый HTTPСервисОтвет(200); 
	
	ЗаписьJSON = Новый ЗаписьJSON; 
	ЗаписьJSON.УстановитьСтроку();
	ЗаписатьJSON(ЗаписьJSON, МассивПользователей);
	СтрокаОтвета = ЗаписьJSON.Закрыть();
	
	Ответ.УстановитьТелоИзСтроки(СтрокаОтвета); 
	
	Возврат Ответ; 
КонецФункции

Функция postUserPOST(Запрос)
	//Логин = Строка(Запрос.ПараметрыЗапроса.Получить("username"));
	//Телефон = Строка(Запрос.ПараметрыЗапроса.Получить("numberphone"));
	
	ЧтениеJSON = Новый ЧтениеJSON;
	ЧтениеJSON.УстановитьСтроку(Запрос.ПолучитьТелоКакСтроку()); 
	ДанныеЗапроса = ПрочитатьJSON(ЧтениеJSON, Ложь);
	ЧтениеJSON.Закрыть();
	
	НовыйПользовательИБ = ПользователиИнформационнойБазы.СоздатьПользователя();
	НовыйПользовательИБ.Имя = ДанныеЗапроса.Наименование;
	НовыйПользовательИБ.Роли.Добавить(Метаданные.Роли.ПолныеПрава);
	НовыйПользовательИБ.Записать();
	
	НоваяЗапись = Справочники.Контрагенты.СоздатьЭлемент(); 
	НоваяЗапись.Наименование = ДанныеЗапроса.Наименование;
	НоваяЗапись.КонтактныйТелефон = ДанныеЗапроса.Телефон;
	НоваяЗапись.ТипКонтрагента = ПредопределенноеЗначение("Перечисление.ТипыКонтрагентов.Клиент");
	НоваяЗапись.Родитель = Справочники.Контрагенты.НайтиПоКоду("000000001");
	НоваяЗапись.Комментарий = "Контрагент зарегистрирован через мобильное приложение!"; 
	
	Попытка
		НоваяЗапись.Записать(); 
		ТекстОтвета = "Создан элемент справочника контрагенты ";
		Ответ = Новый HTTPСервисОтвет(200);
	Исключение
		Ответ = Новый HTTPСервисОтвет(500);
		ТекстОтвета = "Произошла ошибка при создании элемента справочника контрагенты!";
	КонецПопытки;
	
	НовыйПользователь = Справочники.Пользователи.СоздатьЭлемент();
	НовыйПользователь.Код = НовыйПользовательИБ.УникальныйИдентификатор;  
	НовыйПользователь.Наименование = ДанныеЗапроса.Наименование;
	НовыйПользователь.Клиент = Справочники.Контрагенты.НайтиПоНаименованию(ДанныеЗапроса.Наименование);
	НовыйПользователь.Записать(); 
		
	Ответ.УстановитьТелоИзСтроки(ТекстОтвета);
	
	Возврат Ответ;
	
КонецФункции
