
Процедура ОбработкаПолученияДанныхВыбора(ДанныеВыбора, Параметры, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
    
    СписокДоступныхЗначений = Новый СписокЗначений;
    СписокДоступныхЗначений.Добавить(ПредопределенноеЗначение("Перечисление.ВидыОперацийРасходаДенег.ВыдачаПодотчетнику"));
    СписокДоступныхЗначений.Добавить(ПредопределенноеЗначение("Перечисление.ВидыОперацийРасходаДенег.ВозвратПокупателю"));
    СписокДоступныхЗначений.Добавить(ПредопределенноеЗначение("Перечисление.ВидыОперацийРасходаДенег.ВыдачаЗаработнойПлаты"));
    СписокДоступныхЗначений.Добавить(ПредопределенноеЗначение("Перечисление.ВидыОперацийРасходаДенег.ОплатаПоставщику"));
    
    ДанныеВыбора = СписокДоступныхЗначений;
КонецПроцедуры
