
Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	Если ЗначениеЗаполнено(Ссылка) И УслугаОказана = Ложь Тогда
    	ПроверитьОказаниеУслуг();
	КонецЕсли;
	
	ДлительностьУслуг = РассчитатьДатуОкончанияЗаписи();
	Если ДлительностьУслуг = 0 Тогда 
	    ДлительностьУслуг = 60;
	КонецЕсли;
	Если НЕ ЗначениеЗаполнено(ДлительностьУслуг) Тогда
		ДатаОкончанияЗаписи = Неопределено;	
	Иначе
		ДатаОкончанияЗаписи = ДатаЗаписи + ДлительностьУслуг*60; 
	КонецЕсли; 
	СуммаДокумента = Услуги.Итог("Сумма");
КонецПроцедуры

Функция РассчитатьДатуОкончанияЗаписи()

	ТЧУслуги = Услуги.Выгрузить(,"Услуга"); 

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ТЧУслуги", ТЧУслуги); 
	Запрос.Текст=
	"ВЫБРАТЬ
	|    ТЧУслуги.Услуга КАК Услуга
	|ПОМЕСТИТЬ ВТ_Услуга
	|ИЗ
	|    &ТЧУслуги КАК ТЧУслуги
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|    СУММА(Ном.ДлительностьУслуги) КАК ДлительностьУслуги
	|ИЗ
	|    ВТ_Услуга КАК ВТ_Услуга
	|        ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК Ном
	|        ПО ВТ_Услуга.Услуга = Ном.Ссылка";

	Рез = Запрос.Выполнить();
	Если Рез.Пустой() Тогда
	    возврат 0;
	КонецЕсли;

	Выборка = Запрос.Выполнить().Выбрать();
	Выборка.Следующий();
	Возврат Выборка.ДлительностьУслуги;

КонецФункции 

Процедура ПроверитьОказаниеУслуг()

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ДокументОснование",Ссылка);

	Запрос.Текст = "ВЫБРАТЬ
	 |    Реализация.Ссылка КАК Ссылка
	 |ИЗ
	 |    Документ.Реализация КАК Реализация
	 |ГДЕ
	 |    Реализация.ДокументОснование = &ДокументОснование
	 |    И Реализация.Проведен
	 |
	 |СГРУППИРОВАТЬ ПО
	 |    Реализация.Ссылка";

	Рез = Запрос.Выполнить();
	Если НЕ Рез.Пустой() Тогда
	    УслугаОказана = Истина;
	КонецЕсли;

КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, Режим)
	
	Движения.ЗаказыКлиентов.Записывать = Истина;
	Движение = Движения.ЗаказыКлиентов.Добавить();
	Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
	Движение.Период = Дата;
	Движение.Клиент = Клиент;
	Движение.Сумма = Услуги.Итог("Сумма"); 
	Движение.ЗаказКлиента = Ссылка;

	
КонецПроцедуры
