
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если НЕ ЗначениеЗаполнено(Объект.Ответственный) Тогда
		Объект.Ответственный = ПараметрыСеанса.ТекущийПользователь;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	ПересчитатьСуммуДокумента();
	//Объект.СуммаДокумента = Объект.Товары.Итог("Сумма") + Объект.Услуги.Итог("Сумма");
КонецПроцедуры

&НаКлиенте
Процедура ПересчитатьСуммуДокумента()
	Объект.СуммаДокумента = Объект.Товары.Итог("Сумма") + Объект.Услуги.Итог("Сумма");
КонецПроцедуры

//////////////////////////////////////////////////////////////////////////////ТЧ ТОВАРЫ
&НаКлиенте
Процедура ТоварыКоличествоПриИзменении(Элемент)
	СтрокаТЧ = Элементы.Товары.ТекущиеДанные;
	РаботаСТабличнымиЧастямиКлиент.ПересчитатьСуммуВСтрокеТабличнойЧасти(СтрокаТЧ);
КонецПроцедуры 


&НаКлиенте
Процедура ТоварыНоменклатураПриИзменении(Элемент)
	СтрокаТЧ = Элементы.Товары.ТекущиеДанные; 
	//СтрокаТЧ.Цена = РаботаСЦенами.ПолучитьЦенуНоменклатурыПоставщиков(СтрокаТЧ.Товар, Объект.Дата, Объект.Поставщик);
КонецПроцедуры


&НаКлиенте
Процедура ТоварыЦенаПриИзменении(Элемент)
	СтрокаТЧ = Элементы.Товары.ТекущиеДанные;
	РаботаСТабличнымиЧастямиКлиент.ПересчитатьСуммуВСтрокеТабличнойЧасти(СтрокаТЧ);
КонецПроцедуры

&НаКлиенте
Процедура ТоварыПриИзменении(Элемент)
	 ПересчитатьСуммуДокумента();
КонецПроцедуры


 //////////////////////////////////////////////////////////////////////////////ТЧ УСЛУГИ
&НаКлиенте
Процедура УслугиКоличествоПриИзменении(Элемент)
	СтрокаТЧ = Элементы.Услуги.ТекущиеДанные;
	РаботаСТабличнымиЧастямиКлиент.ПересчитатьСуммуВСтрокеТабличнойЧасти(СтрокаТЧ);
КонецПроцедуры


&НаКлиенте
Процедура УслугиЦенаПриИзменении(Элемент)
	СтрокаТЧ = Элементы.Услуги.ТекущиеДанные;
	РаботаСТабличнымиЧастямиКлиент.ПересчитатьСуммуВСтрокеТабличнойЧасти(СтрокаТЧ);
КонецПроцедуры


&НаКлиенте
Процедура УслугиУслугаПриИзменении(Элемент)
	СтрокаТЧ = Элементы.Услуги.ТекущиеДанные;
	Если ЗначениеЗаполнено(СтрокаТЧ.Услуга) Тогда
    	СтрокаТЧ.СтатьяЗатрат = ПолучитьСтатьюЗатратПоНоменклатуре(СтрокаТЧ.Услуга);
	КонецЕсли;
	//СтрокаТЧ.Цена = РаботаСЦенами.ПолучитьЦенуНоменклатурыПоставщиков(СтрокаТЧ.Товар, Объект.Дата, Объект.Поставщик);
КонецПроцедуры

&НаКлиенте
Процедура УслугиПриИзменении(Элемент)
	 ПересчитатьСуммуДокумента();
КонецПроцедуры


&НаСервереБезКонтекста
Функция ПолучитьСтатьюЗатратПоНоменклатуре(Номенклатура)
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка", Номенклатура);
	Запрос.Текст=
		"ВЫБРАТЬ
		|    Номенклатура.СтатьяЗатрат КАК СтатьяЗатрат
		|ИЗ
		|    Справочник.Номенклатура КАК Номенклатура
		|ГДЕ
		|    Номенклатура.Ссылка = &Ссылка";  
	
	Выборка = Запрос.Выполнить().Выбрать();
	Выборка.Следующий();  
	
	Возврат Выборка.СтатьяЗатрат;
КонецФункции






